; domain
(define (domain strips_movie_x_1-domain)
  (:requirements :strips)
  (:predicates
    (movie_rewound)
    (counter_at_two_hours)
    (counter_at_other_than_two_hours)
    (counter_at_zero)
    (have_chips)
    (have_dip)
    (have_pop)
    (have_cheese)
    (have_crackers)
    (chips ?x)
    (dip ?x)
    (pop ?x)
    (cheese ?x)
    (crackers ?x)
  )
  (:action rewind_movie_2
    :parameters ()
    :precondition (and (counter_at_two_hours))
    :effect (and (movie_rewound))
  )
  (:action rewind_movie
    :parameters ()
    :precondition (and (counter_at_other_than_two_hours))
    :effect (and (movie_rewound) (not (counter_at_zero)))
  )
  (:action reset_counter
    :parameters ()
    :precondition ()
    :effect (and (counter_at_zero))
  )
  (:action get_chips
    :parameters ( ?x)
    :precondition (and (chips ?x))
    :effect (and (have_chips))
  )
  (:action get_dip
    :parameters ( ?x)
    :precondition (and (dip ?x))
    :effect (and (have_dip))
  )
  (:action get_pop
    :parameters ( ?x)
    :precondition (and (pop ?x))
    :effect (and (have_pop))
  )
  (:action get_cheese
    :parameters ( ?x)
    :precondition (and (cheese ?x))
    :effect (and (have_cheese))
  )
  (:action get_crackers
    :parameters ( ?x)
    :precondition (and (crackers ?x))
    :effect (and (have_crackers))
  )
)

; problem
(define (problem strips_movie_x_1-problem)
  (:domain strips_movie_x_1-domain)
  (:objects
    c5 c4 c3 c2 c1 d5 d4 d3 d2 d1 p5 p4 p3 p2 p1 z5 z4 z3 z2 z1 k5 k4 k3 k2 k1
  )
  (:init
    (chips c5)
    (chips c4)
    (chips c3)
    (chips c2)
    (chips c1)
    (dip d5)
    (dip d4)
    (dip d3)
    (dip d2)
    (dip d1)
    (pop p5)
    (pop p4)
    (pop p3)
    (pop p2)
    (pop p1)
    (cheese z5)
    (cheese z4)
    (cheese z3)
    (cheese z2)
    (cheese z1)
    (crackers k5)
    (crackers k4)
    (crackers k3)
    (crackers k2)
    (crackers k1)
    (counter_at_other_than_two_hours)
  )
  (:goal
    (and (movie_rewound) (counter_at_zero) (have_chips) (have_dip) (have_pop) (have_cheese) (have_crackers))
  )
)

; plan
1. (get_cheese z1)
   added: (have_cheese)
   goals met: 1 of 7
2. (get_dip d1)
   added: (have_dip)
   goals met: 2 of 7
3. (get_pop p1)
   added: (have_pop)
   goals met: 3 of 7
4. (get_chips c5)
   added: (have_chips)
   goals met: 4 of 7
5. (get_crackers k2)
   added: (have_crackers)
   goals met: 5 of 7
6. (rewind_movie)
   added: (movie_rewound)
   goals met: 6 of 7
7. (reset_counter)
   added: (counter_at_zero)
   goals met: 7 of 7
